reference/stokesFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

// The geometry points
X0		0;
Y0 		0;
X1 		1;
Y1		1;

Z0 		0;
Z1 		0.1;

// Number of cells in x and y directions
N 		100;

vertices
(
	($X0	$Y0		$Z0) // 0
	($X0	$Y0		$Z1) // 1
	($X1	$Y0		$Z0) // 2
	($X1	$Y0		$Z1) // 3
	($X1	$Y1	 	$Z0) // 4
	($X1	$Y1	 	$Z1) // 5
	($X0    $Y1	 	$Z0) // 6
	($X0    $Y1	 	$Z1) // 7
);

blocks
(
    hex (0 2 4 6 1 3 5 7) ($N $N 1) simpleGrading (1 1 1)
		
);

edges
(
);

boundary
(	
	
	moving_wall
    {
        type wall;
        faces
        (
            (4 6 7 5)
        );
    }
	
	static_wall
    {
        type wall;
        faces
        (
            (2 4 5 3)
			(0 2 3 1)
			(6 0 1 7)
        );
    }
	
	zfaces
    {
        type empty;
        faces
        (
            (0 6 4 2)
			(1 3 5 7)
        );
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //
